Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/library.tmx
Source language: en
Languages: pl

source: All of these encodings can only encode 256 of the 65536 (or 1114111) codepoints defined in Unicode. A simple and straightforward way that can store each Unicode code point, is to store each codepoint as two consecutive bytes. There are two possibilities: Store the bytes in big endian or in little endian order. These two encodings are called UTF-16-BE and UTF-16-LE respectively. Their disadvantage is that if e.g. you use UTF-16-BE on a little endian machine you will always have to swap bytes on encoding and decoding. UTF-16 avoids this problem: Bytes will always be in natural endianness. When these bytes are read by a CPU with a different endianness, then bytes have to be swapped though. To be able to detect the endianness of a UTF-16 byte sequence, there's the so called BOM (the "Byte Order Mark"). This is the Unicode character ``U+FEFF``. This character will be prepended to every UTF-16 byte sequence. The byte swapped version of this character (``0xFFFE``) is an illegal character that may not appear in a Unicode text. So when the first character in an UTF-16 byte sequence appears to be a ``U+FFFE`` the bytes have to be swapped on decoding. Unfortunately upto Unicode 4.0 the character ``U+FEFF`` had a second purpose as a ``ZERO WIDTH NO-BREAK SPACE``: A character that has no width and doesn't allow a word to be split. It can e.g. be used to give hints to a ligature algorithm. With Unicode 4.0 using ``U+FEFF`` as a ``ZERO WIDTH NO-BREAK SPACE`` has been deprecated (with ``U+2060`` (``WORD JOINER``) assuming this role). Nevertheless Unicode software still must be able to handle ``U+FEFF`` in both roles: As a BOM it's a device to determine the storage layout of the encoded bytes, and vanishes once the byte sequence has been decoded into a string; as a ``ZERO WIDTH NO-BREAK SPACE`` it's a normal character that will be decoded like any other.
pl: Wszystkie te kodowania mogą zakodować tylko 256 z 65536 (lub 1114111) punktów kodowych zdefiniowanych w Unikodzie. Prosta i bezpośrednia droga, która może zachować każdy punkt kodowy Unicode, polega na tym aby zachować każdy punkt kodowy jak dwa następujące po sobie bajty. Istnieją dwie możliwości: Zachować bajty w porządku dużego endiana lub małego endiana. Te dwa kodowania są zwane UTF-16-BE i UTF-16-LE odpowiednio. Ich wadą jest to że jeżeli np. użyjesz UTF-16-BE na maszynie z małym endianem będziesz zawsze musiał zamieniać bajty przy kodowaniu i dekodowaniu. UTF-16 omija ten problem: Bajty zawsze będą w naturalnej endianności. Gdy te bajty są wczytane przez CPU z inną endiannością, wtedy bajty muszą jednak być zamienione miejscami. Aby móc wykryć endianność sekwencji bajtów UTF-16, istnieje tak zwany BOM("Byte Order Mark" - z ang. - znak porządku bajtów). To jest znak Unicode ``U+FEFF``. Ten znak doczepiony z przodu do każdej sekwencji UTF-16. Wersja z zamienionymi bajtami tego znaku (``0xFFFE``) jest nielegalnym znakiem który nie może pojawić się w tekście Unicode. Więc gdy pierwszy znak w sekwencji UTF-16 okaże się być ``U+FFFE`` bajty muszą być zamienione podczas dekodowania. Niestety aż do Unicode 4.0 znak ``U+FEFF`` miał drugi sens istnienia jako ``ZEROWEJ DŁUGOŚCI NIEŁAMANA SPACJA``: Znak który nie ma długości i nie pozwala słowom na rozdzielenie. Może np. być używany aby dać podpowiedzi dla algorytmu ligaturowego. Wraz z Unicode-m w wersji 4.0 użycie ``U+FEFF`` jako ``ZEROWEJ DŁUGOŚCI NIEŁAMANA SPACJA`` stało się przestarzałe (z ``U+2060`` (``ŁĄCZNIKIEM SŁÓW``) przejmującym jego rolę). Mimo to, oprogramowanie Unicode wciąż musi być w stanie obsłużyć ``U+FEFF`` w obu znaczeniach: Jako BOM jest to narzędzie do określania układu przechowywania dla zakodowanych bajtów, i znika gdy sekwencja bajtów zostanie zdekodowana w ciąg znaków; jako ``ZEROWEJ DŁUGOŚCI NIEŁAMANA SPACJA jest to normalny znak który będzie dekodowany jak każdy inny.

source: There's another encoding that is able to encoding the full range of Unicode characters: UTF-8. UTF-8 is an 8-bit encoding, which means there are no issues with byte order in UTF-8. Each byte in a UTF-8 byte sequence consists of two parts: Marker bits (the most significant bits) and payload bits. The marker bits are a sequence of zero to six 1 bits followed by a 0 bit. Unicode characters are encoded like this (with x being payload bits, which when concatenated give the Unicode character):
pl: Istnieje inne kodowanie które jest w stanie zakodować pełen zakres znaków Unicode: UTF-8. UTF-8 jest kodowaniem 8-bitowym co oznacza że nie ma problemów z kolejnością bajtów w UTF-8. Każdy bajt w sekwencji bajtów UTF-8 składa się z dwóch części: Bitów znacznika (najbardziej znaczące bity) i bity ładowności. Bity znacznika są sekwencją od zera do sześciu bitów 1 po których następuje bit 0. Znaki Unicode-u są zakodowane tak, jak (z x będącym bitami ładowności które gdy sklejone dają znak Unicode):

source: Range
pl: Zakres

source: Encoding
pl: Kodowanie

source: The least significant bit of the Unicode character is the rightmost x bit.
pl: Najmniej ważny bit znaku Unicode jest najbardziej wysuniętym na prawo bitem x.

source: As UTF-8 is an 8-bit encoding no BOM is required and any ``U+FEFF`` character in the decoded string (even if it's the first character) is treated as a ``ZERO WIDTH NO-BREAK SPACE``.
pl: Jako że UTF-8 jest 8-bitowym kodowaniem żadne BOM nie jest wymagane i każdy znak ``U+FEFF`` w zdekodowanym ciągu znaków (nawet gdy jest to pierwszy znak) jest traktowany jako ``ZEROWEJ DŁUGOŚCI NIEŁAMANA SPACJA``.

source: Without external information it's impossible to reliably determine which encoding was used for encoding a string. Each charmap encoding can decode any random byte sequence. However that's not possible with UTF-8, as UTF-8 byte sequences have a structure that doesn't allow arbitrary byte sequences. To increase the reliability with which a UTF-8 encoding can be detected, Microsoft invented a variant of UTF-8 (that Python 2.5 calls ``"utf-8-sig"``) for its Notepad program: Before any of the Unicode characters is written to the file, a UTF-8 encoded BOM (which looks like this as a byte sequence: ``0xef``, ``0xbb``, ``0xbf``) is written. As it's rather improbable that any charmap encoded file starts with these byte values (which would e.g. map to
pl: Bez zewnętrznej informacji nie możliwe jest określenie które kodowanie zostało użyte dla zakodowania ciągu znaków. Każde kodowanie mapy znaków może dekodować dowolną przypadkową sekwencję bajtów. Jednakże to nie jest możliwe z UTF-8, jako że sekwencje bajtów UTF-8 mają strukturę która nie pozwala na dowolną kolejność bajtów. Aby zwiększyć wiarygodność z którą kodowanie UTF-8 może być wykryte, Microsoft stworzył wartiant UTF-8 (które Pyton 2.5 nazywa ``"utf-8-sig"``) dla swojego programu notatnika: Zanim jakiekolwiek znaki unikodu są zapisywane do pliku Zakodowany w UTF-8 BOM (który wygląda następująco jako sekwencja bajtów: ``0xef``, ``0xbb``, ``0xbf``) jest zapisywany. Jako że jest raczej mało prawdopodobne że dowolny zakodowany mapą znaków plik zaczyna się od tych wartości bajtów (które byłyby mapowały na przykład do:

source: LATIN SMALL LETTER I WITH DIAERESIS
pl: ŁACIŃSKA MAŁA LITERA I Z DIAEREZĄ

source: RIGHT-POINTING DOUBLE ANGLE QUOTATION MARK
pl: W PRAWO-SKIEROWANY PODWÓJNEGO KĄTA ZNAK CYTATU

source: INVERTED QUESTION MARK
pl: ODWRÓCONY ZNAK ZAPYTANIA

source: in iso-8859-1), this increases the probability that a utf-8-sig encoding can be correctly guessed from the byte sequence. So here the BOM is not used to be able to determine the byte order used for generating the byte sequence, but as a signature that helps in guessing the encoding. On encoding the utf-8-sig codec will write ``0xef``, ``0xbb``, ``0xbf`` as the first three bytes to the file. On decoding utf-8-sig will skip those three bytes if they appear as the first three bytes in the file.
pl: w iso-8859-1), to zwiększa prawdopodobieństwo że kodowanie utf-8-sig może być właściwie zgadnięte z sekwencji bajtów. Tutaj więc BOM nie jest użytwany aby móc określić kolejność bajtów używanych do generowania sekwencji bajtów, ale jako sygnatura która pomaga w zgadnięciu kodowania. Przy kodowaniu utf-8-sig kodek napisze ``0xef``, ``0xbb``, ``0xbf`` jako pierwsze trzy bajty pliku. Przy dekodowaniu utf-8-sig ominie te trzy bajty jeśli pojawią się jako pierwsze trzy bajty w pliku.

source: Standard Encodings
pl: Standardowe kodowania

source: Python comes with a number of codecs built-in, either implemented as C functions or with dictionaries as mapping tables. The following table lists the codecs by name, together with a few common aliases, and the languages for which the encoding is likely used. Neither the list of aliases nor the list of languages is meant to be exhaustive. Notice that spelling alternatives that only differ in case or use a hyphen instead of an underscore are also valid aliases; therefore, e.g. ``'utf-8'`` is a valid alias for the ``'utf_8'`` codec.
pl: Język pytonowski dostarczany jest z pewną liczbą kodeków wbudowanych, albo wypełnianych jako zadania C albo ze słownikami jako tabelami mapowania. Następująca tabela wypisuje kodeki po nazwie razem z kilkoma typowymi synonimami, i językami dla których kodowanie jest prawdopodobnie używane. Ani lista synonimów ani lista języków nie są przeznaczone aby były wyczerpujące. Zauważ alternatywne pisownie które tylko różnią się wielkością znaków lub używają myślnika zamiast podkreślenia są także poprawnymi synonimami; dlatego też np. ``'utf-8'`` jest poprawnym synonimem dla kodeka ``'utf_8'``.

source: Many of the character sets support the same languages. They vary in individual characters (e.g. whether the EURO SIGN is supported or not), and in the assignment of characters to code positions. For the European languages in particular, the following variants typically exist:
pl: Wiele zbiorów znaków wspiera te same języki. Różnią się pojedynczymi znakami (np. czy ZNAK EURO jest wspierany czy nie), i przypisanie znaków do pozycji kodów. Dla języków europejskich w szczególności, następujące warianty typowo istnieją:

source: an ISO 8859 codeset
pl: zestaw kodów ISO 8859

source: a Microsoft Windows code page, which is typically derived from a 8859 codeset, but replaces control characters with additional graphic characters
pl: Strona kodowa Microsoft Windows która jest typowo odziedziczona po zestawie kodów 8859, ale zamienia znaki kierunków na dodatkowe znaki graficzne

source: an IBM EBCDIC code page
pl: Strona kodowa IBM EBCDIC

source: an IBM PC code page, which is ASCII compatible
pl: Strona kodowa IBM PC, która jest zgodna z ASCII

source: Aliases
pl: Synonimy

source: Languages
pl: Języki

source: English
pl: Angielski

source: Traditional Chinese
pl: Tradycyjny Chiński

source: Hebrew
pl: Hebrajski

source: Western Europe
pl: Zachodnio Europejski

source: Arabic
pl: Arabski

source: Greek
pl: Grecki

source: Baltic languages
pl: Języki bałtyckie

source: Central and Eastern Europe
pl: Europa centralna i wschodnia

source: Bulgarian, Byelorussian, Macedonian, Russian, Serbian
pl: Bułgarski, Białoruski, Macedoński, Rosyjski i Serbski.

source: Turkish
pl: Turecki

source: Portuguese
pl: Portugalski

source: Icelandic
pl: Islandzki

source: Canadian
pl: Kanadyjski

source: Danish, Norwegian
pl: Duński, Norweski

source: Russian
pl: Rosyjski

source: Thai
pl: Tajski

source: Japanese
pl: Japoński

source: Korean
pl: Koreański

source: Vietnamese
pl: Wietnamski

source: euckr, korean, ksc5601, ks_c-5601, ks_c-5601-1987, ksx1001, ks_x-1001
pl: euckr, koreański, ksc5601, ks_c-5601, ks_c-5601-1987, ksx1001, ks_x-1001

source: chinese, csiso58gb231280, euc- cn, euccn, eucgb2312-cn, gb2312-1980, gb2312-80, iso- ir-58
pl: chiński, csiso58gb231280, euc- cn, euccn, eucgb2312-cn, gb2312-1980, gb2312-80, iso- ir-58

source: Simplified Chinese
pl: Uproszczony Chiński

source: Unified Chinese
pl: Zunifikowany Chiński

source: Japanese, Korean, Simplified Chinese, Western Europe, Greek
pl: Japoński, Koreański, Uproszczony Chiński, Zachodnio-Europejski, Grecki

source: iso-8859-1, iso8859-1, 8859, cp819, latin, latin1, L1
pl: iso-8859-1, iso8859-1, 8859, cp819, łacina, latin1, L1

source: West Europe
pl: Zachodnio europejski

source: Esperanto, Maltese
pl: Esperanto, Maltański

source: iso-8859-5, cyrillic
pl: iso-8859-5, cyrylica

source: iso-8859-6, arabic
pl: iso-8859-6, arabski

source: iso-8859-7, greek, greek8
pl: iso-8859-7, grecki, greek8

source: iso-8859-8, hebrew
pl: iso-8859-8, hebrajski

source: Nordic languages
pl: Języki nordyckie

source: Celtic languages
pl: Języki Celtyckie

source: South-Eastern Europe
pl: Południowo-Wschodnia Europa

source: Ukrainian
pl: Ukraiński

source: Kazakh
pl: Kazachski

source: all languages
pl: wszystkie języki

source: all languages (BMP only)
pl: wszystkie języki (tylko BMP)

source: Purpose
pl: Cel

source: Implements :rfc:`3490`, see also :mod:`encodings.idna`
pl: Wypełnia :rfc:`3490`, zobacz także :mod:`encodings.idna`

source: Windows only: Encode operand according to the ANSI codepage (CP_ACP)
pl: Tylko Windows: Zakoduj operand zgodnie ze stroną kodową ANSI (CP_ACP)

source: Encoding of PalmOS 3.5
pl: Kodowanie PalmOS 3.5

source: Implements :rfc:`3492`
pl: Wypełnia :rfc:`3492`

source: raw_unicode_escape
pl: surowe_ucieczkowe_unicode - z ang. - raw_unicode_escape

source: Produce a string that is suitable as raw Unicode literal in Python source code
pl: Wytwórz ciąg znaków który jest odpowiedni jako surowy literał Unicode w kodzie źródłowym języka pytonowskiego

source: undefined
pl: nie zdefiniowane

source: Raise an exception for all conversions. Can be used as the system encoding if no automatic coercion between byte and Unicode strings is desired.
pl: Zgłoś wyjątek dla wszystkich zamian. Może być używane jako kodowanie systemu jeśli nie jest oczekiwane żadne automatyczne przymuszanie pomiędzy bajtem a ciągiem znaków Unicode.

source: unicode_escape
pl: unicode_escape - ucieczkowe_unicode

source: Produce a string that is suitable as Unicode literal in Python source code
pl: Utwórz ciąg znaków który jest odpowiedni jako literał Unicode w kodzie źródłowym języka pytonowskiego.

source: unicode_internal
pl: wewnętrzny_unicode - z ang. - unicode_internal

source: Return the internal representation of the operand
pl: Zwróć wewnętrzną reprezentację operandu

source: :mod:`encodings.idna` --- Internationalized Domain Names in Applications
pl: :mod:`encodings.idna` --- Umiędzynarodowione nazwy domen w aplikacjach

source: This module implements :rfc:`3490` (Internationalized Domain Names in Applications) and :rfc:`3492` (Nameprep: A Stringprep Profile for Internationalized Domain Names (IDN)). It builds upon the ``punycode`` encoding and :mod:`stringprep`.
pl: Ten moduł wypełnia :rfc:`3490` (umiędzynarodowione nazwy domen w aplikacjach) i :rfc:`3492` (Nameprep: Profil Stringprep dla umiędzynarodowionych nazw domen (IDN - internationalized Domain Names)). Buduje nad kodowaniem ``punycode`` i :mod:`stringprep`.

source: These RFCs together define a protocol to support non-ASCII characters in domain names. A domain name containing non-ASCII characters (such as ``www.Alliancefrançaise.nu``) is converted into an ASCII-compatible encoding (ACE, such as ``www.xn--alliancefranaise-npb.nu``). The ACE form of the domain name is then used in all places where arbitrary characters are not allowed by the protocol, such as DNS queries, HTTP :mailheader:`Host` fields, and so on. This conversion is carried out in the application; if possible invisible to the user: The application should transparently convert Unicode domain labels to IDNA on the wire, and convert back ACE labels to Unicode before presenting them to the user.
pl: Te RFC razem definiują protokół aby wspierać znaki nie-ASCII w nazwach domen. Nazwy domen zawierające znaki nie-ASCII (takie jak: ``www.Alliancefrançaise.nu``) jest konwertowane do kodowania zgodnego z ASCII: (ACE, takiego jak ``www.xn--alliancefranaise-npb.nu``). Forma ACE nazwy domeny jest wtedy używana we wszystkich miejscach gdzie dowolne znaki nie są dozwolone przez protokół, takie jak zapytania DNS, pola :mailheader:`Host` HTTP, itd. Ta zamiana jest wykonywana w aplikacji; jeśli możliwe niewidoczne dla użytkownika: Aplikacja powinna w przezroczysty sposób zamieniać nazwy domen Unicode do IDNA na linii, i zamieniać wstecz nazwy ACE do Unicode przed zaprezentowaniem ich do użytkownika.

source: Python supports this conversion in several ways: The ``idna`` codec allows to convert between Unicode and the ACE. Furthermore, the :mod:`socket` module transparently converts Unicode host names to ACE, so that applications need not be concerned about converting host names themselves when they pass them to the socket module. On top of that, modules that have host names as function parameters, such as :mod:`http.client` and :mod:`ftplib`, accept Unicode host names (:mod:`http.client` then also transparently sends an IDNA hostname in the :mailheader:`Host` field if it sends that field at all).
pl: Język pytonowski wspiera tą zamianę w na różne sposoby: kodek ``idna`` pozwala konwertować pomiędzy Unicode i ACE. Dalej moduł :mod:`socket` przezroczyście zamienia nazwy hosta Unicode na ACE, tak że aplikacje nie muszą się martwić o zamianę nazw hosta własnoręcznie gdy przekazują je do modułu gniazda. Na domiar tego, moduły które mają nazwy hosta jako parametry zadań, takie jak :mod:`http.client` i :mod:`ftplib` akceptują nazwy hosta Unicode (:mod:`http.client` wtedy także przezroczyście wysyłają nazwę hosta IDNA w nagłówku :mailheader:`Host` jeśli wysyła to pole w ogóle).

source: When receiving host names from the wire (such as in reverse name lookup), no automatic conversion to Unicode is performed: Applications wishing to present such host names to the user should decode them to Unicode.
pl: Gdy otrzymuje się nazwy hosta z linii (tak, jak w odwróconym podglądzie nazwy), żadna automatyczna konwersja Unicode nie jest wykonywana: Aplikacje które chciałyby prezentować takie nazwy hosta do użytkownika powinny dekodować je do Unikodu.

source: The module :mod:`encodings.idna` also implements the nameprep procedure, which performs certain normalizations on host names, to achieve case-insensitivity of international domain names, and to unify similar characters. The nameprep functions can be used directly if desired.
pl: Moduł :mod:`encodings.idna` wypełnia także procedurę nameprep, która wytwarza określone normalizacje na nazwach hosta, aby osiągnąć niewrażliwość na wielkość liter umiędzynarodowionych nazw domen, i aby zunifikować podobne znaki. Zadania nameprep mogą być używane bezpośrednio jeśli jest taka potrzeba.

source: Return the nameprepped version of *label*. The implementation currently assumes query strings, so ``AllowUnassigned`` is true.
pl: Zwróć z przygotowaną nazwą wersję *fiszki*. To wypełnienie obecnie zajmuje ciągi zapytań, więc ``AllowUnassigned`` jest prawdziwe.

source: Convert a label to ASCII, as specified in :rfc:`3490`. ``UseSTD3ASCIIRules`` is assumed to be false.
pl: Zamień fiszkę na ASCII, jak określono w :rfc:`3490`. ``UseSTD3ASCIIRules`` jest zakładane że będzie fałszywe.

source: Convert a label to Unicode, as specified in :rfc:`3490`.
pl: Zamień nazwę na Unicode, jak określono w :rfc:`3490`.

source: :mod:`encodings.mbcs` --- Windows ANSI codepage
pl: :mod:`encodings.mbcs` --- strona kodowa Windows ANSI

source: Encode operand according to the ANSI codepage (CP_ACP). This codec only supports ``'strict'`` and ``'replace'`` error handlers to encode, and ``'strict'`` and ``'ignore'`` error handlers to decode.
pl: Zakoduj operand w zgodzie ze stroną kodową ANSI (CP_ACP). Ten kodek wspiera tylko obsługę błędów ``'strict'`` i ``'replace'`` dla kodowania i obsługę błędów ``'strict'`` i ``'ignore'`` dla dekodowania.

source: Availability: Windows only.
pl: Dostępność: tylko w Windows.

source: :mod:`encodings.utf_8_sig` --- UTF-8 codec with BOM signature
pl: :mod:`encodings.utf_8_sig` --- kodek UTF-8 z sygnaturą BOM

source: This module implements a variant of the UTF-8 codec: On encoding a UTF-8 encoded BOM will be prepended to the UTF-8 encoded bytes. For the stateful encoder this is only done once (on the first write to the byte stream). For decoding an optional UTF-8 encoded BOM at the start of the data will be skipped.
pl: Ten moduł wypełnia wariant kodeka UTF-8: Na kodowaniu UTF-8 zakodowany BOM (Znacznik Porządku Bajtów) zostanie doklejony z przodu do zakodowanych bajtów w UTF-8. Dla kodera pełnego stanu to jest wykonywane tylko raz (podczas pierwszego zapisu do strumienia bajtów). Dla dekodowania opcjonalnie zakodowany BOM na początku danych zostanie ominięty.

source: :mod:`codeop` --- Compile Python code
pl: :mod:`codeop` --- Kompiluje kod języka pytonowskiego.

source: The :mod:`codeop` module provides utilities upon which the Python read-eval-print loop can be emulated, as is done in the :mod:`code` module. As a result, you probably don't want to use the module directly; if you want to include such a loop in your program you probably want to use the :mod:`code` module instead.
pl: Moduł :mod:`codeop` dostarcza użyteczności na której pętla języka pytonowskiego wczytaj-oblicz-wydrukuj może być emulowana, tak jak jest to dokonywane w module :mod:`code`. Jako wynik prawdopodobnie nie będziesz chciał używać tego modułu bezpośrednio; jeśli chcesz zawrzeć taką pętlę w swoim programie pewnie będziesz chciał użyć modułu :mod:`code` zamiast tego.

source: There are two parts to this job:
pl: Istnieją dwie części dotyczące tej pracy:

source: Being able to tell if a line of input completes a Python statement: in short, telling whether to print '``>>>``' or '``...``' next.
pl: Bycie w stanie powiedzieć czy linia wejściowa uzupełnia wyrażenie języka pytonowskiego: w skrócie powiedzenie czy wydrukować '``>>>``' czy '``...``' w następnej kolejności.

source: Remembering which future statements the user has entered, so subsequent input can be compiled with these in effect.
pl: Zapamiętanie które przyszłe wyrażenia użytkownik wpisał, więc następne wejście może być skompilowane z tym w efekcie.

source: The :mod:`codeop` module provides a way of doing each of these things, and a way of doing them both.
pl: Moduł :mod:`codeop` dostarcza sposób robienia każdej z tych rzeczy i sposób robienia ich obojga.

source: To do just the former:
pl: Aby wykonać tylko to pierwsze:

source: Tries to compile *source*, which should be a string of Python code and return a code object if *source* is valid Python code. In that case, the filename attribute of the code object will be *filename*, which defaults to ``'<input>'``. Returns ``None`` if *source* is *not* valid Python code, but is a prefix of valid Python code.
pl: Próbuje skompilować *źródło*, które powinno być ciągiem znaków kodu języka pytonowskiego i zwrócić przedmiot kodu jeśli *źródło* jest poprawnym kodem języka pytonowskiego. W tym przypadku właściwość przedmiotu kodu *nazwą pliku* która domyślnie równa jest ``'<input>'``. Zwraca ``None`` jeśli *źródło* nie jest właściwym kodem języka pytonowskiego, ale jest przedrostkiem właściwego kodu języka Pytonowskiego.

source: If there is a problem with *source*, an exception will be raised. :exc:`SyntaxError` is raised if there is invalid Python syntax, and :exc:`OverflowError` or :exc:`ValueError` if there is an invalid literal.
pl: Jeśli istnieje problem ze *źródłem* wyjątek zostanie zgłoszony. :exc:`SyntaxError` jest zgłaszany jeśli istnieje nieprawidłowa składnia języka pytonowskiego i :exc:`OverflowError` lub :exc:`ValueError` jeśli jest nieprawidłowy literał.
